# Series

In [1]:
import pandas as pd

In [2]:
series2=pd.Series([10,20,30,40,50],index=['a','b','c','d','e'])

In [3]:
series2

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
print(series2+5)

a    15
b    25
c    35
d    45
e    55
dtype: int64

In [5]:
data={"abc":1,"def":2,"ghi":3}

In [6]:
data

{'abc': 1, 'def': 2, 'ghi': 3}

In [7]:
pd.Series(data)

abc    1
def    2
ghi    3
dtype: int64

# Data Frame

In [8]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [9]:
data=[["swarn1",10,"4star"],["sudhanshu2",20,"4star"],["apurva3",30,"4star"],["swarn4",10,"4star"],["sudhanshu5",20,"4star"],["apurva6",30,"4star"]]

In [10]:
data

[['swarn', 10, '4star'],
 ['sudhanshu', 20, '4star'],
 ['apurva', 30, '4star'],
 ['swarn', 10, '4star'],
 ['sudhanshu', 20, '4star'],
 ['apurva', 30, '4star']]

In [11]:
df=pd.DataFrame(data)

In [12]:
df

           0   1      2
0      swarn  10  4star
1  sudhanshu  20  4star
2     apurva  30  4star
3      swarn  10  4star
4  sudhanshu  20  4star
5     apurva  30  4star

In [13]:
df=pd.DataFrame(data,columns=["name","scorecard","lifegoal"])

In [14]:
df

        name  scorecard lifegoal
0      swarn         10    4star
1  sudhanshu         20    4star
2     apurva         30    4star
3      swarn         10    4star
4  sudhanshu         20    4star
5     apurva         30    4star

In [15]:
df.name

0        swarn
1    sudhanshu
2       apurva
3        swarn
4    sudhanshu
5       apurva
Name: name, dtype: object

In [16]:
df.lifegoal

0    4star
1    4star
2    4star
3    4star
4    4star
5    4star
Name: lifegoal, dtype: object

In [17]:
df["name"]

0        swarn
1    sudhanshu
2       apurva
3        swarn
4    sudhanshu
5       apurva
Name: name, dtype: object

In [18]:
df["goal"]="engineer"

In [19]:
df

        name  scorecard lifegoal      goal
0      swarn         10    4star  engineer
1  sudhanshu         20    4star  engineer
2     apurva         30    4star  engineer
3      swarn         10    4star  engineer
4  sudhanshu         20    4star  engineer
5     apurva         30    4star  engineer

In [20]:
df

        name  scorecard lifegoal      goal
0      swarn         10    4star  engineer
1  sudhanshu         20    4star  engineer
2     apurva         30    4star  engineer
3      swarn         10    4star  engineer
4  sudhanshu         20    4star  engineer
5     apurva         30    4star  engineer

In [21]:
del df['scorecard']

In [22]:
df

        name lifegoal      goal
0      swarn    4star  engineer
1  sudhanshu    4star  engineer
2     apurva    4star  engineer
3      swarn    4star  engineer
4  sudhanshu    4star  engineer
5     apurva    4star  engineer

In [23]:
print(df.loc[1]["goal"]=="programmer")

False

In [24]:
df

        name lifegoal      goal
0      swarn    4star  engineer
1  sudhanshu    4star  engineer
2     apurva    4star  engineer
3      swarn    4star  engineer
4  sudhanshu    4star  engineer
5     apurva    4star  engineer

In [25]:
print(df.loc[1]["goal"])

engineer

In [26]:
print(df.iloc[1])

name        sudhanshu
lifegoal        4star
goal         engineer
Name: 1, dtype: object

In [27]:
print(df.loc[1])

name        sudhanshu
lifegoal        4star
goal         engineer
Name: 1, dtype: object

In [29]:
print(df.head())

        name lifegoal      goal
0      swarn    4star  engineer
1  sudhanshu    4star  engineer
2     apurva    4star  engineer
3      swarn    4star  engineer
4  sudhanshu    4star  engineer

In [30]:
print(df.tail())

        name lifegoal      goal
1  sudhanshu    4star  engineer
2     apurva    4star  engineer
3      swarn    4star  engineer
4  sudhanshu    4star  engineer
5     apurva    4star  engineer

In [31]:
df.dtypes

name        object
lifegoal    object
goal        object
dtype: object

In [32]:
df.describe()

         name lifegoal      goal
count       6        6         6
unique      3        1         1
top     swarn    4star  engineer
freq        2        6         6

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      6 non-null      object
 1   lifegoal  6 non-null      object
 2   goal      6 non-null      object
dtypes: object(3)
memory usage: 276.0+ bytes